{
  "backend/main.mo": "Main backend actor implementing fantasy sports platform with user profiles, player/team/contest management, Stripe payment integration, and role-based access control using authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (user authentication, team creation, contests, leaderboard, Stripe payments) to their source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend files including components, pages, hooks, and configuration files for the fantasy sports application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for a sports-themed UI with vibrant primary and secondary colors.",
  "frontend/index.html": "HTML entry point for the Dream 11 Fantasy Clone application that loads the React app from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, team creation, contests, leaderboard, wallet, and payment pages, wrapped in ThemeProvider and Layout with AuthGuard.",
  "frontend/src/components/AuthGuard.tsx": "Authentication guard component that displays loading states, login prompts for unauthenticated users, profile setup modal for new users, and renders protected routes via Outlet.",
  "frontend/src/components/BudgetTracker.tsx": "Card component displaying budget tracking with progress bar, spent amount, remaining balance, and visual warnings when over budget.",
  "frontend/src/components/ContestCard.tsx": "Card component displaying contest details (name, entry fee, prize pool, participants) with trophy icon and join button that handles participation state.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, responsive navigation (desktop/mobile), footer, and routing using TanStack Router. Includes links to create team, contests, leaderboard, and wallet pages.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login/logout states using Internet Identity, with loading states and error handling that clears and retries on authentication conflicts.",
  "frontend/src/components/PlayerCard.tsx": "Card component displaying player information (name, team, position, price, form) with a toggle button to add/remove players from selection, supporting disabled state.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile creation that prompts for name input and saves the profile using a mutation hook, with validation and toast notifications.",
  "frontend/src/components/StripePaymentSetup.tsx": "Admin-only component that displays an alert when Stripe is not configured and provides a modal dialog to input Stripe secret key and allowed countries for payment setup.",
  "frontend/src/components/TeamFormation.tsx": "Displays selected players organized by position (Goalkeeper, Defender, Midfielder, Forward) in a card layout, showing player count badge and empty state placeholders.",
  "frontend/src/components/WalletBalance.tsx": "Simple card component displaying the user's wallet balance with a gradient background and large formatted currency display.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "Mutation hook that creates a Stripe checkout session via the backend actor, accepting shopping items and generating success/cancel URLs based on current window location.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, identity state, login/logout flows, and delegation validity with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API interactions including user profiles, players, teams, contests, wallet balance, deposits, and Stripe configuration. Each hook uses the actor from useActor and manages query/mutation state with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a vibrant sports theme, defining color variables for light and dark modes (primary green, secondary orange, success, warning, etc.) and utility classes for gradients.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component into the DOM.",
  "frontend/src/pages/Contests.tsx": "Displays all available contests in a grid layout with ContestCard components, allows users to join contests (with team validation), shows participation status, and includes StripePaymentSetup component.",
  "frontend/src/pages/CreateTeam.tsx": "Team creation interface with player selection by position (tabs), budget tracking ($100 limit, 11 player max), visual team formation display, and validation before saving team to backend.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section, feature cards (Create Team, Join Contests, Leaderboard, Wallet), and stats section showcasing the fantasy sports platform's main functionality.",
  "frontend/src/pages/Leaderboard.tsx": "Displays contest leaderboards in a table format with participant rankings, trophy icons for top 3 positions, highlights current user's row, and shows participant counts per contest.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page displaying an error message with options to retry payment (navigate to wallet) or return home.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page that displays a success message with CheckCircle icon and provides navigation buttons to view wallet or browse contests.",
  "frontend/src/pages/Wallet.tsx": "Wallet management page displaying user balance, providing an interface to add funds via Stripe checkout, and showing transaction history placeholder.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, extended theme with custom animations, shadows, and typography plugins.",
  "project_state.json": "Project state tracking document listing implemented features (authentication, team creation, contests, leaderboard, Stripe payments, wallet system, UI theme) and pending feature requests for a fantasy sports platform."
}